Ran Plan for dir: `azure/_poc/compute` workspace: `default`

<details><summary>Show Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
 <= read (data resources)

Terraform will perform the following actions:

  # module.linuxservers.data.azurerm_public_ip.vm[0] will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_public_ip" "vm"  {
      + allocation_method       = (known after apply)
      + domain_name_label       = (known after apply)
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = (known after apply)
      + ip_address              = (known after apply)
      + ip_tags                 = (known after apply)
      + ip_version              = (known after apply)
      + location                = (known after apply)
      + name                    = "terraform-30-days-pip-0"
      + resource_group_name     = "terraform-30-days-poc"
      + reverse_fqdn            = (known after apply)
      + sku                     = (known after apply)
      + zones                   = (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.linuxservers.azurerm_availability_set.vm will be created
+ resource "azurerm_availability_set" "vm" {
      + id                           = (known after apply)
      + location                     = "southeastasia"
      + managed                      = true
      + name                         = "terraform-30-days-avset"
      + platform_fault_domain_count  = 2
      + platform_update_domain_count = 2
      + resource_group_name          = "terraform-30-days-poc"
      + tags                         = {
          + "environment" = "dev"
        }
    }

  # module.linuxservers.azurerm_network_interface.vm[0] will be created
+ resource "azurerm_network_interface" "vm" {
      + applied_dns_servers           = (known after apply)
      + dns_servers                   = (known after apply)
      + enable_accelerated_networking = false
      + enable_ip_forwarding          = false
      + id                            = (known after apply)
      + internal_dns_name_label       = (known after apply)
      + internal_domain_name_suffix   = (known after apply)
      + location                      = "southeastasia"
      + mac_address                   = (known after apply)
      + name                          = "terraform-30-days-nic-0"
      + private_ip_address            = (known after apply)
      + private_ip_addresses          = (known after apply)
      + resource_group_name           = "terraform-30-days-poc"
      + tags                          = {
          + "environment" = "dev"
        }
      + virtual_machine_id            = (known after apply)

      + ip_configuration {
          + name                          = "terraform-30-days-ip-0"
          + primary                       = (known after apply)
          + private_ip_address            = (known after apply)
          + private_ip_address_allocation = "dynamic"
          + private_ip_address_version    = "IPv4"
          + public_ip_address_id          = (known after apply)
          + subnet_id                     = (known after apply)
        }
    }

  # module.linuxservers.azurerm_network_interface_security_group_association.test[0] will be created
+ resource "azurerm_network_interface_security_group_association" "test" {
      + id                        = (known after apply)
      + network_interface_id      = (known after apply)
      + network_security_group_id = (known after apply)
    }

  # module.linuxservers.azurerm_network_security_group.vm will be created
+ resource "azurerm_network_security_group" "vm" {
      + id                  = (known after apply)
      + location            = "southeastasia"
      + name                = "terraform-30-days-nsg"
      + resource_group_name = "terraform-30-days-poc"
      + security_rule       = (known after apply)
      + tags                = {
          + "environment" = "dev"
        }
    }

  # module.linuxservers.azurerm_public_ip.vm[0] will be created
+ resource "azurerm_public_ip" "vm" {
      + allocation_method       = "Dynamic"
      + availability_zone       = (known after apply)
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "southeastasia"
      + name                    = "terraform-30-days-pip-0"
      + resource_group_name     = "terraform-30-days-poc"
      + sku                     = "Basic"
      + tags                    = {
          + "environment" = "dev"
        }
      + zones                   = (known after apply)
    }

  # module.linuxservers.azurerm_virtual_machine.vm-linux[0] will be created
+ resource "azurerm_virtual_machine" "vm-linux" {
      + availability_set_id              = (known after apply)
      + delete_data_disks_on_termination = true
      + delete_os_disk_on_termination    = true
      + id                               = (known after apply)
      + license_type                     = (known after apply)
      + location                         = "southeastasia"
      + name                             = "terraform-30-days-vmLinux-0"
      + network_interface_ids            = (known after apply)
      + resource_group_name              = "terraform-30-days-poc"
      + tags                             = {
          + "environment" = "dev"
        }
      + vm_size                          = "Standard_B1s"

      + boot_diagnostics {
          + enabled = false
        }

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + type         = (known after apply)
        }

      + os_profile {
          + admin_username = "azureuser"
          + computer_name  = "terraform-30-days-0"
          + custom_data    = "da39a3ee5e6b4b0d3255bfef95601890afd80709"
        }

      + os_profile_linux_config {
          + disable_password_authentication = true

          + ssh_keys {
              + key_data = <<-EOT
                    ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDNr+0R/xP6+yTcMkb9QMOMPAbY+hiuP2y1nqlf1wbCms/7QSeBbG+CVTRARTUVZsfr0B2ejv1YNKlnGWLzkl1i1wuhxBUPCfX2eWgbxzgGFb/y4W5OmkRpUrzkRnQIs4ai2tL+pLTniHMs6wFlqUFE4R/ipD6i1U+QpYwgE6t/WvFAJ4vujHSE9FPNwbcc6lqaXOXos+deV0Enq43PbGqw5iiGl2S7xGq0ghpKz4ieO8XOY8Yo2JenmFi2EOtCQbaZ7OAqK7ytFqc+IIolAUHhrPufliLBBFBfqaIGSymL/cjGyHoth+1tvDqijKHrm1LvX51eSOp2o/16N40kCq6H0/QLb7WiUr8G0nX7XBvSrR4ZpQUbf18tvtHnT1RmM/U4SrY9+cJeGoH8sH10CYOKDilh6u6BIBhzWDGmjCgkh1eaBKTWrUAAO0EgzyASK9bYnNSL7mi/L/TuHBRazB9bfH4B30WRQZf1jXFJ2sql8mISpvRiHNNRNCJdEP5Em1c= che-chia@che-chias-MacBook-Pro.local
                EOT
              + path     = "/home/azureuser/.ssh/authorized_keys"
            }
        }

      + storage_data_disk {
          + caching                   = (known after apply)
          + create_option             = (known after apply)
          + disk_size_gb              = (known after apply)
          + lun                       = (known after apply)
          + managed_disk_id           = (known after apply)
          + managed_disk_type         = (known after apply)
          + name                      = (known after apply)
          + vhd_uri                   = (known after apply)
          + write_accelerator_enabled = (known after apply)
        }

      + storage_image_reference {
          + offer     = "UbuntuServer"
          + publisher = "Canonical"
          + sku       = "18.04-LTS"
          + version   = "latest"
        }

      + storage_os_disk {
          + caching                   = "ReadWrite"
          + create_option             = "FromImage"
          + disk_size_gb              = (known after apply)
          + managed_disk_id           = (known after apply)
          + managed_disk_type         = "Premium_LRS"
          + name                      = "osdisk-terraform-30-days-0"
          + os_type                   = (known after apply)
          + write_accelerator_enabled = false
        }
    }

  # module.linuxservers.random_id.vm-sa will be created
+ resource "random_id" "vm-sa" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 6
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
      + keepers     = {
          + "vm_hostname" = "terraform-30-days"
        }
    }

  # module.network.azurerm_subnet.subnet[0] will be created
+ resource "azurerm_subnet" "subnet" {
      + address_prefix                                 = (known after apply)
      + address_prefixes                               = [
          + "10.2.1.0/24",
        ]
      + enforce_private_link_endpoint_network_policies = false
      + enforce_private_link_service_network_policies  = false
      + id                                             = (known after apply)
      + name                                           = "subnet-test-compute"
      + resource_group_name                            = "terraform-30-days-poc"
      + service_endpoints                              = []
      + virtual_network_name                           = "acctvnet"
    }

  # module.network.azurerm_virtual_network.vnet will be created
+ resource "azurerm_virtual_network" "vnet" {
      + address_space         = [
          + "10.2.0.0/16",
        ]
      + dns_servers           = []
      + guid                  = (known after apply)
      + id                    = (known after apply)
      + location              = "southeastasia"
      + name                  = "acctvnet"
      + resource_group_name   = "terraform-30-days-poc"
      + subnet                = (known after apply)
      + tags                  = {
          + "environment" = "dev"
        }
      + vm_protection_enabled = false
    }

Plan: 9 to add, 0 to change, 0 to destroy.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d azure/_poc/compute`
* :put_litter_in_its_place: To **delete** this plan click [here](https://41eb-123-194-159-122.ngrok.io/lock?id=chechiachang%252Fterraform-30-days%252Fazure%252F_poc%252Fcompute%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d azure/_poc/compute`
</details>
Plan: 9 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
